//---------------------------------------------------------------------------

#pragma hdrstop

#include "CorrugatedSheet.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)

std::vector<CorrugatedSheet> CorrigatedSheetsData::corrugated_sheets_list_
{
//Данные из ГОСТ 24045-2016
	{L"Н60-845-0.7", 60, 0.7, 89.5, 50, 211.2, 8.8 },
	{L"Н60-845-0.8", 60, 0.8, 89.5, 50, 211.2, 9.9},
	{L"Н60-845-0.9", 60, 0.9, 89.5, 50, 211.2, 11.1},
	{L"Н75-750-0.7", 75, 0.7, 95.5, 50, 187.5, 9.8},
	{L"Н75-750-0.8", 75, 0.8, 95.5, 50, 187.5, 11.2},
	{L"Н75-750-0.9", 75, 0.9, 95.5, 50, 187.5, 12.5},
	{L"Н114-600-0.8", 114, 0.8, 96, 60, 200, 14.0},
	{L"Н114-600-0.9", 114, 0.9, 96, 60, 200, 15.6},
	{L"Н114-600-1.0", 114, 1.0, 96, 60, 200, 17.2},
	{L"Н114-750-0.8", 114, 0.8, 96, 60, 200, 12.5},
	{L"Н114-750-0.9", 114, 0.9, 96, 60, 200, 14.0},
	{L"Н114-750-1.0", 114, 1.0, 96, 60, 200, 15.4},
	{L"Н153-850-0.8", 153, 0.8, 164, 284 - 241, 284, 11.5},
	{L"Н153-850-1.0", 153, 1.0, 164, 284 - 241, 284, 14.4},
	{L"Н153-850-1.2", 153, 1.2, 164, 284 - 241, 284, 17.1},
	{L"Н153-850-1.5", 153, 1.5, 164, 284 - 241, 284, 21.3},
};

CorrugatedSheet CorrigatedSheetsData::get_corrugated_sheet(const String& name)
{
	auto corrugated_sheet = std::find_if(corrugated_sheets_list_.begin(),corrugated_sheets_list_.end(),
	[name](CorrugatedSheet corrugated_sheet){return corrugated_sheet.get_name() == name;});

	return *corrugated_sheet;
}

double CorrugatedSheet::get_h_b()
{
	if(fully_initialized) return h_b_;

	h_b_ = (b_ + b_ap_) / (2 * S_n_) * h_n_;
	fully_initialized = true;

	return h_b_;
}

CorrugatedSheetsMap corrugated_sheets_map
//Данные из ГОСТ 24045-2016
{
{{L"Н60-845-0.7"},		{L"Н60-845-0.7", 60, 0.7, 8.8}},
{{L"Н60-845-0.8"},		{L"Н60-845-0.8", 60, 0.8, 9.9}},
{{L"Н60-845-0.9"},		{L"Н60-845-0.9", 60, 0.9, 11.1}},
{{L"Н75-750-0.7"},		{L"Н75-750-0.7", 75, 0.7, 9.8}},
{{L"Н75-750-0.8"},		{L"Н75-750-0.8", 75, 0.8, 11.2}},
{{L"Н75-750-0.9"},		{L"Н75-750-0.9", 75, 0.9, 12.5}},
{{L"Н114-600-0.8"},		{L"Н114-600-0.8", 114, 0.8, 14.0}},
{{L"Н114-600-0.9"},		{L"Н114-600-0.9", 114, 0.9, 15.6}},
{{L"Н114-600-1.0"},		{L"Н114-600-1.0", 114, 1.0, 17.2}},
{{L"Н114-750-0.8"},		{L"Н114-750-0.8", 114, 0.8, 12.5}},
{{L"Н114-750-0.9"},		{L"Н114-750-0.9", 114, 0.9, 14.0}},
{{L"Н114-750-1.0"},		{L"Н114-750-1.0", 114, 1.0, 15.4}},
{{L"Н153-850-0.8"},		{L"Н153-850-0.8", 153, 0.8, 11.5}},
{{L"Н153-850-1.0"},		{L"Н153-850-1.0", 153, 1.0, 14.4}},
{{L"Н153-850-1.2"},		{L"Н153-850-1.2", 153, 1.2, 17.1}},
{{L"Н153-850-1.5"},		{L"Н153-850-1.5", 153, 1.5, 21.3}},
};

CorrugatedSheet::CorrugatedSheet()
{
}

CorrugatedSheet::CorrugatedSheet (String name, double h_n, double t, double w):
	name_(name),
	h_n_(h_n),
	t_(t),
	w_(w){}
CorrugatedSheet::CorrugatedSheet (String name, double h_n, double t,
								  double b_ap, double b, double S_n, double w):
	name_(name),
	h_n_(h_n),
	t_(t),
	b_ap_(b_ap),
	b_(b),
	S_n_(S_n),
	w_(w){}

