//---------------------------------------------------------------------------

#pragma hdrstop

#include "InternalForcesBeam.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
//---------------------------------------------------------------------------
//¬ конструкторе задаютс€ размеры map присваиваютс€ id сечени€м.  оординаты и
//номера сечений остаютс€ неизменными. ¬ перечне координат есть сечени€ опор(временных и посто€нных)
//---------------------------------------------------------------------------

 InternalForcesBeam::InternalForcesBeam(std::vector<X> x)
 {
	 CS_Id cs_id = 1;

	std::map<CS_Id, std::pair<X, InternalForces>> ifb_;

	for(const auto x0:x)
	  ifb_.emplace(std::make_pair(cs_id++,std::make_pair(x0,InternalForces{0,0})));

 }

