//---------------------------------------------------------------------------

#ifndef MathFunctionH
#define MathFunctionH
//---------------------------------------------------------------------------
//Проверяет находиться число типа double в пределах границ интервал. Если число
//превышает верхнюю границу, то возвращается значение верхней границы. Если
// число превышает нижнию границу, то возвращается значение нижней границы.
//---------------------------------------------------------------------------
 double clamp( double v, double lo, double hi );
#endif


