//---------------------------------------------------------------------------

#ifndef MathFunctionH
#define MathFunctionH
//---------------------------------------------------------------------------
//Проверяет находиться число типа double в пределах границ интервал. Если число
//превышает верхнюю границу, то возвращается значение верхней границы. Если
// число превышает нижнию границу, то возвращается значение нижней границы.
//---------------------------------------------------------------------------
 double clamp( double v, double lo, double hi );
//---------------------------------------------------------------------------
//Линейная интерполяция/экстраполяция
//---------------------------------------------------------------------------
 double linear_interpolation(double y_0, double y_1, double x_0, double x_1, double x_n);
#endif


