//---------------------------------------------------------------------------
#pragma hdrstop
//---------------------------------------------------------------------------
#include <algorithm>
#include "uStudSP266.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
//---------------------------------------------------------------------------
StudSP266::StudSP266(std::u16string const & name, double d_1, double l_1, double R_y,
	double R_b, double m):
		name_(name), d_1_(d_1), l_1_(l_1), R_y_(R_y)
{
	if ((2.5 < l_1_ / d_1_) && (l_1_ /d_1_ <= 4.2)) //возможен ли вариант, когда отношение l_/d_1_ меньше 2.5. Надо ли бросать исключение?
		P_Rd_ = 0.24 * l_1_ /10 * d_1_/10 * std::pow(10 * R_b , 0.5) * 1000; //1000 перевод в Н, так как в СП кН
	else
		P_Rd_ = d_1_/10 * d_1_/10 * std::pow(10 * R_b, 0.5) * 1000;

   P_Rd_ = std::min(P_Rd_, 0.063 * d_1_/10 * d_1_/10 * m * R_y_ *1000);
}

